from src.domain.entities.user import UserEntity


class StartMessages:
    @staticmethod
    def user_back(user: UserEntity) -> str:
        return (
            f"👋 С возвращением, {user.name}!\n\n"
            f"Вы уже авторизованы. Используйте /help для просмотра команд.\n\n"
        )

    @staticmethod
    def user_authenticated(user: UserEntity) -> str:
        return (
            f"✅ Отлично, {user.name}! Авторизация успешна.\n\n"
            f"Теперь вы можете использовать все функции бота.\n"
            f"Используйте /help для просмотра доступных команд."
        )

    @staticmethod
    def user_not_authenticated(auth_url: str) -> str:
        return (
            f"👋 Добро пожаловать в бот для работы с HeadHunter!\n\n"
            "Для начала работы необходимо авторизоваться:\n"
            f"<a href='{auth_url}'>🔐 Авторизоваться в HH</a>\n\n"
            "После авторизации вы сможете:\n"
            "• Генерировать отклики на вакансии\n"
            "• Просматривать резюме (в разработке)\n"
            "• Просматривать вакансии (в разработке)\n"
            "• Управлять откликами (в разработке)\n"
            "• Работать с резюме (в разработке)\n"
            "• И многое другое!"
        )


class ProfileMessages:
    @staticmethod
    def profile_base(user: UserEntity) -> str:
        return f"👤 <b>Ваш профиль</b>\n\n{user.name}"


class AIMessages:
    @staticmethod
    def no_active_resume() -> str:
        return (
            "Нет активного резюме\n"
            "Перейдите в профиль и выберите резюме, которым вы хотите откликаться /profile"
        )

    @staticmethod
    def request_user_comments() -> str:
        return "Что нужно изменить в отклике?"
